# Brewfile

# https://github.com/melihucar/dotfiles

tap "shivammathur/php"

brew "zsh"
brew "wget"
brew "tmux"
brew "neovim"
brew "htop"
brew "httpie"
brew "jq"
brew "bat"
brew "fzf"
brew "lazygit"

brew "ripgrep"
brew "fd"

brew "nvm"
brew "go"

brew 'redis'

brew "composer"

brew "php@8.0"
brew "php@8.1"
brew "php@8.3"
brew "php@8.4"

brew "dotnet"

cask_args appdir: "~/Applications", require_sha: true

cask "docker-desktop"
cask "jetbrains-toolbox"
cask "phpstorm"
cask "google-chrome"
cask "font-fira-code-nerd-font"
cask "iterm2"
cask "visual-studio-code"
cask "cursor"
cask "slack"
cask "tableplus"
